Heltec-Aaron-Lee/WiFi_Kit_series/esp8266/boards.txt
#
# Do not create pull-requests for this file only, CI will not accept them.
# You *must* edit/modify/run boards.txt.py to regenerate boards.txt.
# All modified files after running with option "--allgen" must be included in the pull-request.
#

menu.BoardModel=Model
menu.baud=Upload Speed
menu.xtal=CPU Frequency
menu.CrystalFreq=Crystal Frequency
menu.eesz=Flash Size
menu.FlashMode=Flash Mode
menu.FlashFreq=Flash Frequency
menu.ResetMethod=Reset Method
menu.ESPModule=Module
menu.dbg=Debug port
menu.lvl=Debug Level
menu.ip=lwIP Variant
menu.vt=VTables
menu.exception=Exceptions
menu.led=Builtin Led
menu.wipe=Erase Flash

##############################################################
heltec.name=WiFi_Kit_8
heltec.build.board=ESP8266_GENERIC
heltec.build.variant=heltec
heltec.upload.tool=esptool
heltec.upload.maximum_data_size=81920
heltec.upload.wait_for_upload_port=true
heltec.upload.erase_cmd=
heltec.serial.disableDTR=true
heltec.serial.disableRTS=true
heltec.build.mcu=esp8266
heltec.build.core=esp8266
heltec.build.spiffs_pagesize=256
heltec.build.debug_port=
heltec.build.debug_level=
heltec.menu.xtal.80=80 MHz
heltec.menu.xtal.80.build.f_cpu=80000000L
heltec.menu.xtal.160=160 MHz
heltec.menu.xtal.160.build.f_cpu=160000000L
heltec.menu.vt.flash=Flash
heltec.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
heltec.menu.vt.heap=Heap
heltec.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
heltec.menu.vt.iram=IRAM
heltec.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
heltec.menu.exception.disabled=Disabled
heltec.menu.exception.disabled.build.exception_flags=-fno-exceptions
heltec.menu.exception.disabled.build.stdcpp_lib=-lstdc++
heltec.menu.exception.enabled=Enabled
heltec.menu.exception.enabled.build.exception_flags=-fexceptions
heltec.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
heltec.upload.resetmethod=nodemcu
heltec.build.flash_mode=dio
heltec.build.flash_freq=40
heltec.menu.eesz.4M=4M (no SPIFFS)
heltec.menu.eesz.4M.build.flash_size=4M
heltec.menu.eesz.4M.build.flash_size_bytes=0x400000
heltec.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
heltec.menu.eesz.4M.build.spiffs_pagesize=256
heltec.menu.eesz.4M.upload.maximum_size=1044464
heltec.menu.eesz.4M.build.rfcal_addr=0x3FC000
heltec.menu.eesz.4M1M=4M (1M SPIFFS)
heltec.menu.eesz.4M1M.build.flash_size=4M
heltec.menu.eesz.4M1M.build.flash_size_bytes=0x400000
heltec.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
heltec.menu.eesz.4M1M.build.spiffs_pagesize=256
heltec.menu.eesz.4M1M.upload.maximum_size=1044464
heltec.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
heltec.menu.eesz.4M1M.build.spiffs_start=0x300000
heltec.menu.eesz.4M1M.build.spiffs_end=0x3FB000
heltec.menu.eesz.4M1M.build.spiffs_blocksize=8192
heltec.menu.eesz.4M2M=4M (2M SPIFFS)
heltec.menu.eesz.4M2M.build.flash_size=4M
heltec.menu.eesz.4M2M.build.flash_size_bytes=0x400000
heltec.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
heltec.menu.eesz.4M2M.build.spiffs_pagesize=256
heltec.menu.eesz.4M2M.upload.maximum_size=1044464
heltec.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
heltec.menu.eesz.4M2M.build.spiffs_start=0x200000
heltec.menu.eesz.4M2M.build.spiffs_end=0x3FB000
heltec.menu.eesz.4M2M.build.spiffs_blocksize=8192
heltec.menu.eesz.4M3M=4M (3M SPIFFS)
heltec.menu.eesz.4M3M.build.flash_size=4M
heltec.menu.eesz.4M3M.build.flash_size_bytes=0x400000
heltec.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
heltec.menu.eesz.4M3M.build.spiffs_pagesize=256
heltec.menu.eesz.4M3M.upload.maximum_size=1044464
heltec.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
heltec.menu.eesz.4M3M.build.spiffs_start=0x100000
heltec.menu.eesz.4M3M.build.spiffs_end=0x3FB000
heltec.menu.eesz.4M3M.build.spiffs_blocksize=8192
heltec.menu.ip.lm2f=v2 Lower Memory
heltec.menu.ip.lm2f.build.lwip_include=lwip2/include
heltec.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
heltec.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
heltec.menu.ip.hb2f=v2 Higher Bandwidth
heltec.menu.ip.hb2f.build.lwip_include=lwip2/include
heltec.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
heltec.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
heltec.menu.ip.lm2n=v2 Lower Memory (no features)
heltec.menu.ip.lm2n.build.lwip_include=lwip2/include
heltec.menu.ip.lm2n.build.lwip_lib=-llwip2-536
heltec.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
heltec.menu.ip.hb2n=v2 Higher Bandwidth (no features)
heltec.menu.ip.hb2n.build.lwip_include=lwip2/include
heltec.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
heltec.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
heltec.menu.ip.lm6f=v2 IPv6 Lower Memory
heltec.menu.ip.lm6f.build.lwip_include=lwip2/include
heltec.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
heltec.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
heltec.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
heltec.menu.ip.hb6f.build.lwip_include=lwip2/include
heltec.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
heltec.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
heltec.menu.ip.hb1=v1.4 Higher Bandwidth
heltec.menu.ip.hb1.build.lwip_lib=-llwip_gcc
heltec.menu.ip.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
heltec.menu.ip.src=v1.4 Compile from source
heltec.menu.ip.src.build.lwip_lib=-llwip_src
heltec.menu.ip.src.build.lwip_flags=-DLWIP_OPEN_SRC
heltec.menu.ip.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
heltec.menu.dbg.Disabled=Disabled
heltec.menu.dbg.Disabled.build.debug_port=
heltec.menu.dbg.Serial=Serial
heltec.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
heltec.menu.dbg.Serial1=Serial1
heltec.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
heltec.menu.lvl.None____=None
heltec.menu.lvl.None____.build.debug_level=
heltec.menu.lvl.SSL=SSL
heltec.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
heltec.menu.lvl.TLS_MEM=TLS_MEM
heltec.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
heltec.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
heltec.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
heltec.menu.lvl.HTTP_SERVER=HTTP_SERVER
heltec.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
heltec.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
heltec.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
heltec.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
heltec.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
heltec.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
heltec.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
heltec.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
heltec.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
heltec.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
heltec.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
heltec.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
heltec.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
heltec.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
heltec.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
heltec.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
heltec.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
heltec.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
heltec.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
heltec.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
heltec.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
heltec.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
heltec.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
heltec.menu.lvl.CORE=CORE
heltec.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
heltec.menu.lvl.WIFI=WIFI
heltec.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
heltec.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
heltec.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
heltec.menu.lvl.UPDATER=UPDATER
heltec.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
heltec.menu.lvl.OTA=OTA
heltec.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
heltec.menu.lvl.OOM=OOM
heltec.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
heltec.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
heltec.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
heltec.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
heltec.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
heltec.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
heltec.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
heltec.menu.wipe.none=Only Sketch
heltec.menu.wipe.none.upload.erase_cmd=
heltec.menu.wipe.sdk=Sketch + WiFi Settings
heltec.menu.wipe.sdk.upload.erase_cmd=-ca "{build.rfcal_addr}" -cz 0x4000
heltec.menu.wipe.all=All Flash Contents
heltec.menu.wipe.all.upload.erase_cmd=-ca 0x0 -cz "{build.flash_size_bytes}"
heltec.menu.baud.921600=921600
heltec.menu.baud.921600.upload.speed=921600
heltec.menu.baud.9600=9600
heltec.menu.baud.9600.upload.speed=9600
heltec.menu.baud.57600=57600
heltec.menu.baud.57600.upload.speed=57600
heltec.menu.baud.115200=115200
heltec.menu.baud.115200.upload.speed=115200
heltec.menu.baud.230400.linux=230400
heltec.menu.baud.230400.macosx=230400
heltec.menu.baud.230400.upload.speed=230400
heltec.menu.baud.256000.windows=256000
heltec.menu.baud.256000.upload.speed=256000
heltec.menu.baud.460800.linux=460800
heltec.menu.baud.460800.macosx=460800
heltec.menu.baud.460800.upload.speed=460800
heltec.menu.baud.512000.windows=512000
heltec.menu.baud.512000.upload.speed=512000

